brain/Young Entrepreneurs.tex
% Created 2017-09-25 Mon 10:01
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Kadin Buckton}
\date{\today}
\title{Young Entrepreneurship}
\hypersetup{
 pdfauthor={Kadin Buckton},
 pdftitle={Young Entrepreneurship},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.1 (Org mode 9.0.10)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Facts}
\label{sec:orga39fcb6}
\begin{itemize}
\item Nearly one third of 18-35 year-olds rated entrepreneurship as the more desirable profession
32 percent
\end{itemize}

\section{Challenges}
\label{sec:org34b0271}
\begin{itemize}
\item The greatest challenge facing a young entrepreneur is the lack of experience and knowledge they bring to a venture
\item Young entrepreneurs typically have no credit history, no collateral and no track record of paying off a debt
\end{itemize}

\section{The Value of Experience}
\label{sec:org841db57}
\begin{itemize}
\item Part time and summer work, volunteer opportunities, and school leadership positions offer young people opportunities to develop their enterprising and entrepreneur skills.
\end{itemize}

Working part-time or full-time can provide great opportunities such as:
\begin{itemize}
\item Learn about the infrastructure
\item Develop a positive reputation in t he industry
\item Build a network of contacts
\item Earn money you can save for the future
\item Learn firsthand about the industry
\end{itemize}

\section{Strategies for Entrepreneurship Success}
\label{sec:orgb1ae454}
\begin{itemize}
\item Think First
Planning is crucial! Remember that reflective decisions are typically better than impulsive ones.
\item Believe in Yourself
Improve your own performance rather than competing with others
\item Know Yourself
When planning your venture, take time to consider your own abilities, character traits, skills and goals.
\item Enjoy the Challenge
To be worth your time and effort, a venture should challenge your abilities, encourage your creativity, suit your personality, and be compatible with the vision of yourself
\end{itemize}
\end{document}
